#+BEGIN_SRC elisp
(org-pm-make-projects)
#+END_SRC

#+RESULTS:
| project2-b | :base-extension | org | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :project-name | project2-b | :node-id | 4A719A44-893F-45CC-A2D0-E9E2AF8B7B89 | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/parse-tests2.org | :project-id | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/parse-tests2.org::#4A719A44-893F-45CC-A2D0-E9E2AF8B7B89 | :last-updated | [2013-12-22 Sun 12:49] | :folder | this is project 2   |
| project1-b | :base-extension | org | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :project-name | project1-b | :node-id | B77CA7F9-0E70-4989-A5E6-95E20C48F963 | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/parse-tests2.org | :project-id | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/parse-tests2.org::#B77CA7F9-0E70-4989-A5E6-95E20C48F963 | :last-updated | [2013-12-22 Sun 12:49] | :folder | this is a project 1 |

#+BEGIN_SRC elisp
org-publish-project-alist
#+END_SRC

#+BEGIN_SRC elisp
org-pm-project-def-duplicates
#+END_SRC

#+RESULTS:
| project1-b | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/parse-tests.org::#B77CA7F9-0E70-4989-A5E6-95E20C48F963 |
| project2-b | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/parse-tests.org::#4A719A44-893F-45CC-A2D0-E9E2AF8B7B89 |

#+BEGIN_SRC elisp

  (let* ((project)
        (plist)
        (template-string)
        (def-node
          (car (org-map-entries '(cadr (org-element-at-point)) "PROJECT_DEFS")))
        (buffer (get-buffer-create "*def*")))
    (save-excursion
      (set-buffer buffer)
      (insert-file-contents org-pm-project-template-file-name)
      (beginning-of-buffer)
      (when project
        (replace-string "PROJECTNAME" (car project))
        (beginning-of-buffer)
        (replace-string "BASEDIRECTORY" (plist-get plist :base-directory))
        (beginning-of-buffer)
        (replace-string "PUBLISHINGDIRECTORY" (plist-get plist :publishing-directory)))
      (setq template-string (buffer-string)))
    (message "%s" (car def-node))
    (goto-char (plist-get def-node :begin))
    (end-of-line)
    (org-paste-subtree nil template-string)
    )
#+END_SRC

#+RESULTS:
: (:raw-value test :begin 4039 :end 4367 :pre-blank 1 :hiddenp nil :contents-begin 4117 :contents-end 4367 :level 2 :priority nil :tags (PROJECT_DEFS) :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :quotedp nil :CATEGORY parse-tests2 :title test)


#+BEGIN_SRC elisp
  ;; (replace-string "PROJECTNAME" "projectname")
  (org-match-sparse-tree nil "PROJECT_DEFS")
#+END_SRC

#+RESULTS:



** test                                                       :PROJECT_DEFS:
*** PROJECTNAME

**** base-directory "BASEDIRECTORY"

**** base-extension "org"
**** publishing-directory "PUBLISHINGDIRECTORY"
**** publishing-function 'org-html-publish-to-html
**** headline-levels 4
**** section-numbers nil
**** with-toc t
**** html-preamble t
**** static-base-directory "BASEDIRECTORY/static/"
**** static-publishing-directory "PUBLISHINGDIRECTORY/static/"
*** PROJECTNAME

**** base-directory "BASEDIRECTORY"

**** publishing-directory "PUBLISHINGDIRECTORY"

*** project1-b
:PROPERTIES:
:ID:       B77CA7F9-0E70-4989-A5E6-95E20C48F963
:END:
asdf asdf asdf asdf
**** folder "this is a project 1"
*** project2-b
:PROPERTIES:
:ID:       4A719A44-893F-45CC-A2D0-E9E2AF8B7B89
:END:
**** folder "this is project 2"
